---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightKey.Dispose
source: html/8fd68d6b-dc29-ae1b-1d90-a680fc42a31c.htm
---
# Autodesk.Revit.DB.ExportLineweightKey.Dispose Method

Releases all resources used by the ExportLineweightKey

## Syntax (C#)
```csharp
public void Dispose()
```